In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("supershops.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [5]:
df.shape
type(df["Area"])

pandas.core.series.Series

In [6]:
df.columns.dtype

dtype('O')

In [7]:
x = df.drop('Profit', axis=1)
y = df['Profit']

In [8]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [9]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [10]:
x1 = x.copy()
x2 = x.copy()
x3 = x.copy()
x4 = x.copy()
x5 = x.copy()

In [11]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

# Normalization

In [12]:
from sklearn.preprocessing import MinMaxScaler

In [13]:
m = MinMaxScaler()  #feature_range=(0, 1)

In [14]:
df_mar_sp = m.fit(x[['Marketing Spend']])  #calculating
df_mar_sp

MinMaxScaler()

In [15]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [16]:
x['Marketing Spend'] = m.transform(x[['Marketing Spend']])

In [17]:
x['Marketing Spend'].head(10)

0    0.692617
1    0.983359
2    0.927985
3    0.873136
4    0.859438
5    0.797566
6    0.814128
7    0.788018
8    0.729018
9    0.745906
Name: Marketing Spend, dtype: float64

In [18]:
#fit_transform()
x['Marketing Spend'] = m.fit_transform(x[['Marketing Spend']])
x.head(10)

   Marketing Spend  Administration  Transport     Area
0         0.692617       136897.80  471784.10    Dhaka
1         0.983359       151377.59  443898.53      Ctg
2         0.927985       101145.55  407934.54  Rangpur
3         0.873136       118671.85  383199.62    Dhaka
4         0.859438        91391.77  366168.42  Rangpur
5         0.797566        99814.71  362861.36    Dhaka
6         0.814128       147198.87  127716.82      Ctg
7         0.788018       145530.06  323876.68  Rangpur
8         0.729018       148718.95  311613.29    Dhaka
9         0.745906       108679.17  304981.62      Ctg

In [19]:
x[['Marketing Spend', 'Administration', 'Transport'
   ]] = m.fit_transform(x[['Marketing Spend', 'Administration', 'Transport']])
x.head(5)

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

In [20]:
#Loop

In [21]:
numeric_columns = x.select_dtypes(include=['float64']).columns
for col in numeric_columns:
    x[col] = m.fit_transform(x[numeric_columns])
x.head(5)

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.692617   0.692617    Dhaka
1         0.983359        0.983359   0.983359      Ctg
2         0.927985        0.927985   0.927985  Rangpur
3         0.873136        0.873136   0.873136    Dhaka
4         0.859438        0.859438   0.859438  Rangpur

In [22]:
x['Marketing Spend'].min()

0.0

In [23]:
x['Marketing Spend'].max()

1.0

In [24]:
x['Marketing Spend'].std()

0.27760797440996104

In [25]:
#do manually

In [26]:
columns_to_normalization = ['Marketing Spend', 'Administration', 'Transport']

for col in columns_to_normalization:
    mins = x[col].min()
    maxs = x[col].max()
    normalized = (x[col] - mins) / (maxs - mins)

x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.692617   0.692617    Dhaka
1         0.983359        0.983359   0.983359      Ctg
2         0.927985        0.927985   0.927985  Rangpur
3         0.873136        0.873136   0.873136    Dhaka
4         0.859438        0.859438   0.859438  Rangpur

# Standard Scaler

In [27]:
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html

In [28]:
from sklearn.preprocessing import StandardScaler

In [29]:
StdScaler = StandardScaler()

In [30]:
#sklearn

In [31]:
x2[['Marketing Spend', 'Administration',
    'Transport']] = StdScaler.fit_transform(
        x2[['Marketing Spend', 'Administration', 'Transport']])
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

In [32]:
x2['Marketing Spend'].std()

1.0101525445522108

In [33]:
x2['Marketing Spend'].mean()

-7.549516567451065e-17

In [34]:
#do manually

In [35]:
columns_to_standardize = ['Marketing Spend', 'Administration', 'Transport']

for col in columns_to_standardize:
    mean = x2[col].mean()
    std = x2[col].std()
    x2[col] = (x2[col] - mean) / std
    
x2.head(5)

   Marketing Spend  Administration  Transport     Area
0         0.888889        0.555117   2.143079    Dhaka
1         1.936203        1.071924   1.910049      Ctg
2         1.736731       -0.720938   1.609511  Rangpur
3         1.539157       -0.095396   1.402811    Dhaka
4         1.489812       -1.069066   1.260487  Rangpur

# Robust

In [36]:
from sklearn.preprocessing import RobustScaler

In [37]:
rs = RobustScaler()

In [38]:
x3[['Marketing Spend', 'Administration', 'Transport']] = rs.fit_transform(
    x3[['Marketing Spend', 'Administration', 'Transport']])
x3.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur

In [39]:
x3['Marketing Spend'].mean()

0.010873592001353067

In [40]:
x3['Marketing Spend'].min()

-1.184616654474728

# Max Abs

In [41]:
from sklearn.preprocessing import MaxAbsScaler

abs_scaler = MaxAbsScaler()

In [42]:
x4[['Marketing Spend', 'Administration',
    'Transport']] = abs_scaler.fit_transform(
        x4[['Marketing Spend', 'Administration', 'Transport']])
x4.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.749527   1.000000    Dhaka
1         0.983359        0.828805   0.940893      Ctg
2         0.927985        0.553781   0.864664  Rangpur
3         0.873136        0.649738   0.812235    Dhaka
4         0.859438        0.500378   0.776136  Rangpur

In [43]:
x4['Marketing Spend'].mean()

0.4458540809390067

In [44]:
y = df['Profit']

In [45]:
y = df[['Profit']]

# Log Transfrom

In [46]:
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.FunctionTransformer.html

In [47]:
import numpy as np
from sklearn.preprocessing import FunctionTransformer

transformer = FunctionTransformer(np.log1p)

In [48]:
column_to_transform = ['Marketing Spend', 'Administration', 'Transport']

x5[column_to_transform] = transformer.transform(x5[column_to_transform])

In [49]:
x5.head(5)

   Marketing Spend  Administration  Transport     Area
0        11.648545       11.826997  13.064279    Dhaka
1        11.999040       11.927539  13.003354      Ctg
2        11.941081       11.524326  12.918864  Rangpur
3        11.880158       11.684126  12.856314    Dhaka
4        11.864345       11.422922  12.810851  Rangpur

In [50]:
# Get the numeric columns to transform
numeric_columns = x5.select_dtypes(include=['float64']).columns

# Apply log transformation to all numeric columns
x5[numeric_columns] = transformer.transform(x5[numeric_columns])

#print(x5)
x5.head(5)

   Marketing Spend  Administration  Transport     Area
0         2.537542        2.551552   2.643638    Dhaka
1         2.564876        2.559360   2.639297      Ctg
2         2.560407        2.527673   2.633245  Rangpur
3         2.555688        2.540351   2.628741    Dhaka
4         2.554460        2.519543   2.625455  Rangpur

In [51]:
df.to_excel("test.xlsx")

In [55]:
test = pd.read_excel("test.xlsx")
test.head(5)

   Unnamed: 0  Marketing Spend  Administration  Transport     Area     Profit
0           0        114523.61       136897.80  471784.10    Dhaka  192261.83
1           1        162597.70       151377.59  443898.53      Ctg  191792.06
2           2        153441.51       101145.55  407934.54  Rangpur  191050.39
3           3        144372.41       118671.85  383199.62    Dhaka  182901.99
4           4        142107.34        91391.77  366168.42  Rangpur  166187.94